Api_Cointic/app/Models/Marca.php

SELECT `CatMarcas`.*
FROM `CatMarcas`
ORDER BY `CatMarcas`.`idMarcas`, `Nombre`
 LIMIT 5
---
    function getMarcas($page, $pageSize, $sort, $order)
	{
        $db      = \Config\Database::connect();
		$builder = $db->table('CatMarcas');
        $builder->select("CatMarcas.*");
		$builder->orderBy('CatMarcas.idMarcas', $order);
		$builder->orderBy('Nombre', $order);
		$offset = $pageSize * $page;
		$builder->limit($pageSize,$offset);
		return $builder->get()->getResultArray();