Api_Cointic/app/Models/Producto.php

    function getProductos($page, $pageSize, $sort, $order,$filtro)
	{
        $db      = \Config\Database::connect();
		$builder = $db->table('CatProduct_Fort');
        $builder->select("CatProduct_Fort.*");
		$builder->like("SKU",$filtro,"both");
		$builder->orlike("Unit",$filtro,"both");
		$builder->orlike("Description",$filtro,"both");
		$builder->orderBy('CatProduct_Fort.	idProducto_Fort', $order);
		// $builder->orderBy('Unit', $order);
		// $builder->orderBy('SKU', $order);
		// $builder->orderBy('Description', $order);
		// $builder->orderBy('Price', $order);
		// $builder->orderBy('Contract_1Yr', $order);
		// $builder->orderBy('Contract_2Yr', $order);
		// $builder->orderBy('Contract_3Yr', $order);
		// $builder->orderBy('Contract_4Yr', $order);
		// $builder->orderBy('Contract_5Yr', $order);
		// $builder->orderBy('Comments', $order);
		// $builder->orderBy('Category', $order);
		$builder->orderBy('idrel', $order);
		$offset = $pageSize * $page;
		$builder->limit($pageSize,$offset);
		return $builder->get()->getResultArray();
---
SELECT *
FROM `CatProduct_Fort`

    function selectRelProductosSolucion()
	{
        $db      = \Config\Database::connect();
        $builder = $db->table('relmarcasolucion');
		$builder->select("relmarcasolucion.idrel,CONCAT(CatMarcas.Nombre,' - ',CatSoluciones.nombre ) as nombreSolucion");
		$builder->join("CatSoluciones","CatSoluciones.idsoluciones=relmarcasolucion.idsoluciones","left");
		$builder->join("CatMarcas","CatMarcas.idMarcas=relmarcasolucion.idmarca","left");
		return $builder->get()->getResultArray();
---
SELECT `relmarcasolucion`.`idrel`, CONCAT(CatMarcas.Nombre, ' - ', CatSoluciones.nombre ) as nombreSolucion
FROM `relmarcasolucion`
LEFT JOIN `CatSoluciones` ON `CatSoluciones`.`idsoluciones`=`relmarcasolucion`.`idsoluciones`
LEFT JOIN `CatMarcas` ON `CatMarcas`.`idMarcas`=`relmarcasolucion`.`idmarca`