Api_Cointic/app/Models/Solucion.php

	function getNumeroSoluciones($page, $pageSize, $sort, $order)
	{
        $db      = \Config\Database::connect();
		$builder = $db->table('CatSoluciones');
		$builder->select("*");
		return $builder->get()->getNumRows();
---
SELECT *
FROM `CatSoluciones`