Api_Cointic/app/Models/Usuario.php

SELECT `CatUsuarios`.*
FROM `CatUsuarios`
 LIMIT 5
---
	function getUsuario($idUsuario)
	{
		$db      = \Config\Database::connect();
		$builder = $db->table('CatUsuarios');
		return $builder->select("CatUsuarios.*")

			// ->join("CatPerfiles", "CatUsuarios.idPerfil = CatPerfiles.idPerfil")
			->where("CatUsuarios.idUsuario", $idUsuario)->get()->getRowArray();
	}

	/*function getUsuarios($page, $pageSize)
	{
		$db      = \Config\Database::connect();
		$builder = $db->table('CatUsuarios');
		$builder->select("CatUsuarios.*");
		//$builder->join("CatPerfiles", "CatUsuarios.idPerfil = CatPerfiles.idPerfil");
		//$builder->join("CatGasolineras", "CatUsuarios.idGasolinera = CatGasolineras.idGasolinera");
		//$builder->group_by("CatUsuarios.idUsuario");
		//$builder->orderBy('nombreDepartamento', $order);
		$offset = $pageSize * $page;
		$builder->limit($pageSize, $offset);
		return $builder->get()->getResultArray();