Api_Cointic/app/Models/Venta.php

	function deletetemprodcompra($idCliente= NULL,$purge = false)
	{
		$db      = \Config\Database::connect();
		$builder = $db->table('temprodtransaccion');
        $builder->select("temprodtransaccion.idTransaccion");
		$builder->where('temprodtransaccion.idCliente', $idCliente);
		$comp= $builder->get()->getResultArray();
---
SELECT `prodtransaccion`.*
FROM `prodtransaccion`
WHERE `prodtransaccion`.`idCliente` = '36'
ORDER BY `prodtransaccion`.`idTransaccion` DESC
 LIMIT 1