Api_Cointic/app/Models/Watchguard.php

    function selectRelProductosSolucion()
	{
        $db      = \Config\Database::connect();
        $builder = $db->table('relmarcasolucion');
		$builder->select("relmarcasolucion.idrel,CONCAT(CatMarcas.Nombre,' - ',CatSoluciones.nombre ) as nombreSolucion");
		$builder->join("CatSoluciones","CatSoluciones.idsoluciones=relmarcasolucion.idsoluciones","left");
		$builder->join("CatMarcas","CatMarcas.idMarcas=relmarcasolucion.idmarca","left");
		return $builder->get()->getResultArray();
---
SELECT `relmarcasolucion`.`idrel`, CONCAT(CatMarcas.Nombre, ' - ', CatSoluciones.nombre ) as nombreSolucion
FROM `relmarcasolucion`
LEFT JOIN `CatSoluciones` ON `CatSoluciones`.`idsoluciones`=`relmarcasolucion`.`idsoluciones`
LEFT JOIN `CatMarcas` ON `CatMarcas`.`idMarcas`=`relmarcasolucion`.`idmarca`